// pages/trurh_or_dare/truth_or_dare.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    question:''

  },
  gototruth: function(){
    var truth=["大学一共挂过几门课？","大学所有考试中，你考到最低的一门是什么课，考了几分？","第一个喜欢的异性叫什么名字？","让你一直念念不忘的一位异性的名字？为什么？","曾经有过最被感动的事是什么？","你人生中最害怕什么？","最近一次流泪是在什么时候，为什么？","做过最羞耻的事是什么？","你最喜欢什么颜色？","如果变成动物，你希望自己变成什么？","最能与你产生共鸣的电影是什么?","坚持最久的习惯或爱好是？","独自旅游的话你会选择去哪里？","描述一次自己的神操作","收到过最感动的礼物是什么？","分手后会删前任的联系方式吗？","你觉得提分手的人和被提分手的人，哪个更难过？","什么时候会觉得自己特别美/帅？","最近一次说谎是什么时候，为什么？","说说你最讨厌自己哪一点？","有没有以前很要好的朋友，但是现在没有联系了，为什么？","如果你可以坐时光机去到未来，你最想知道什么？","你在寂寞的时候最容易想起谁？","你是否在乎他人的眼光和评价？","你最在乎的人或事情是什么？","如果时光可以倒流，你最想回到什么时候，为什么？","最近令你最难过的事情是什么？","说说你做过的最愚蠢的事？","你最信任的那个人是谁，为什么？","最近一次失眠是什么时候，因为什么而失眠？","对你人生影响最大的人是？","如果让你选择做电影中的某个角色，你会选谁呢，为什么？","你做过的最后悔的事是什么？","如果明天是世界末日，你现在最想做的是什么？","说说最近发生的一件让你开心的事？","说说童年时最有趣的一次经历？","你最喜欢的三种食物是什么？","你向往的生活状态是什么样的？","你生活中有没有什么特殊的癖好？","你最想改掉的一个缺点是什么？","假如可以选择世界上任何人，你希望邀请谁共进晚餐？","对你来说，怎样才算是“完美”的一天？","你的人生中最感恩的事情是什么？","有什么事想做很久了却一直没去做，为什么？","你最糟糕的回忆是什么？","你觉得有什么事是绝对不能开玩笑的?","有没有什么有趣的脑洞？","如果突然获得500万(税后)，会怎么安排？","如果穿越的话，想去哪个朝代？","你觉得自己的脸皮薄还是厚？","别人有给你取过哪些外号？","你会用哪三个词语形容你自己？","你最反感别人的什么行为？","说说你做过的最难忘的一场梦？","说说你最害怕的一个人？","有没有一件事，给你带来了很大的心理阴影？","你最大的愿望是什么？","你最喜欢的一首歌是什么？","你最不喜欢的颜色是什么？","你有什么被骗的经历？","说说最让你得意的一件事？","你觉得自己最厉害的是哪方面？","你做过的最疯狂的一件事是什么？","你有恨过的人吗？","如果可以的话，你最想打谁？"];
    this.setData({
      question: truth[Math.floor(Math.random()*truth.length)]
    }) 
  },
  gotodare: function(){
    var truth=["走猫步","唱青藏高原最后一句","用最妩媚的动作拨动一下头发","模仿五种动物叫声","唱一首自己熟悉的歌","模仿脑白金广告，边唱边跳","选一个男生，一边锤他胸口一边说：你好讨厌哦","大喊：我是猪","选一人与他喝交杯酒","站起来大喊：我是超人，我要回家了","讲一个可以让在场的某个人大笑的笑话","用动作和表情使在场的一个人大笑","两个人面对面做搓澡状，唱“洗刷刷，洗刷刷”","左手拉右耳朵，右手拉左耳朵，从桌子底下过","露出肚皮，扭腰扭屁股","对着窗外大喊：我好寂寞啊","用手纸当围巾，围在脖子上","蹲在凳子上作便秘状","去厕所里唱一首歌","学超级名模走秀，绕房间走两圈","模仿喝一杯烈酒的样貌喝完一杯白开水","说一个绕口令","先大笑五秒，再大哭五秒，反复三次","闭上眼睛，左转三圈，右转三圈，再睁开眼睛，回到自己的座位上","模仿一位自己熟悉的明星","面对墙壁，然后大声地喊三声：我爱你","将书本顶在头顶，学模特走台步，书掉了要重来","抱着垃圾桶傻笑三分钟","让在场的一个人混合一杯饮料给你喝","用舌头舔自己胳膊肘","做一个瑜伽动作","选择在场的一个人背着他走一圈","选一个人跟你离开房间五分钟","表演一下你中毒即将死去的样子","在座每个人轮流打一下你的屁股","做一个你觉得最man的动作","做一个你认为最有女人味的动作","选择在场的一个人给他头部按摩一分钟","给大家分享一张你手机上的照片","给大家展示一下你的qq好友列表","删除微信任意一个好友 ","选择在场的一个人为他捶背一分钟","反串演唱一首歌曲","做十个俯卧撑","选择在场的一个人对他赞美一分钟","给一个很久不联系的朋友发“天王盖地虎”","一口气喝完一瓶矿泉水","看着一个人的眼睛叫一声爸爸","在超过50人的群聊里发一段自己唱的歌","模仿迈克尔杰克逊的太空步","跟在场的一个人假装深情表白","当众做出卖萌的表情给大家拍照","把你qq列表中最讨厌的一个人拉黑","选择在场的一个人拔掉他的一根头发","展示一下你最近的淘宝购物记录","模仿追星族，找在场的一个人索要签名","做平板支撑一分钟","边跳骑马舞边唱江南style","做十个蛙跳"];
    this.setData({
      question: truth[Math.floor(Math.random()*truth.length)]
    }) 
  },
  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})